{"results": [{"text": "Implementing AI in the IoT-based Healthcare Application for Logistics\n\nMinimized health risks and costs reduction by automating the real-time support service.\n\n    Challenge\n    Enhance IoT healthcare application with AI\n    Solution\n    ML model to process data in the Client’s database and generate push notifications\n    Technologies and tools\n    Python + DS, APNs, AWS Lambda, PostgreSQL, Swift (iOS)\n\nClient\n\nThe Client is a European-based company specializing in delivering IT solutions for businesses across different industries. To improve the existing business approach by implementing modern technologies, the client needed a healthcare application integrated with the IoT and AI solutions to improve working conditions for employees and boost the efficiency of services. The Client was looking for experts in the AI software development field.\nChallenge: enhance IoT healthcare application with AI\n\nAs an experienced provider of AI software development services, InData Labs was challenged to train a machine learning (ML) model to augment the Client’s existing solution. Our engineering team was tasked to build a model able to efficiently process large amounts of historical data and data gathered from wearable devices to create and deliver data-based push notifications for iOS as the output.\n\nThe IoT component was a wristband that measured a driver’s heart rate before and during each trip. This data wasn’t enough for a reliable evaluation of health status. For systemizing and crunching more data, the existing solution required an additional ML-based model.\nSolution: ML model to process several types of data and generate personalized notifications\n\nThe IoT healthcare application is intended for drivers of commercial vehicles having health problems. Preventing emergency cases is a part of the business owner’s employee care and expense management program.\n\nThe InData Labs’ team started with scrutinizing the existing solution. Our AI research and development experts dived into the capabilities of the existing app to come up with the best ways to enhance it.\n\nApart from the data collected via wristbands, we fetched the following types of data to the model as the input:\n\n    Driver’s heart rate\n    Driver’s gender and age\n    Historical heart rate data\n    Weather information\n    Time of day\n    Route & destination\n\nThe gathered data was fed into the Client’s database for further processing. So, the following data sources were used to get the input for the ML-model:\n\nML model to process several types of data\n\nBased on the comprehensive input data, we trained the model to perform the following tasks:\n\n    Analyze the health status of drivers\n    Detect health problems\n    Generate push notifications\n    Send alerts and recommendations to drivers\n\nThe algorithm splits the received output into the 3 categories or zones. Depending on one or another category, different push notifications and recommendations are sent to drivers from the server. The examples are the following:\n\nML model to generate personalized notifications\n\nTo complete the task, the InData Labs’ team used the Apple Push Notification service (APNs) to enable the remote notifications feature. Our team also used the Client’s service to store and process data.\nResult: ML-powered expense management solution, cost reduction as a result of processes automation\n\nThe InData Labs’ team successfully delivered the ML model that allowed the merging of IoT and AI to enhance the Client’s healthcare application. The provided algorithm facilitated data crunching and enabled data-driven push notifications for iOS devices.\n\nThe embedded algorithm efficiently worked with different types of data and allowed creating more personalized recommendations. Also, the solution by InData Labs allowed the owner of a commercial vehicle fleet to take better care of employees, improve working conditions for drivers, minimize health risks, and cut costs by automating the real-time support service.\n", "source": "https://indatalabs.com/resources/ai-in-iot"}, {"text": "Industry: Personalized health guidance\n\nLocation: Chapel Hill, NC\n\nHow it’s using AI: Well allows people to live better lives and receive the medical guidance they need quickly, allowing them to make more informed decisions about the care they receive.\n\nDriven by a proprietary AI-driven “health engine” that helps personalize health guidance to each user, Well guides people through the right health journey based on their pre-existing conditions, ongoing health concerns and gaps in general health knowledge. The health engine combines both personal and external health data to provide informed advice based on other user experiences while also providing points that can be redeemed at stores for completing challenges and supporting communities, helping users with everything from screenings and questionnaires through prescription support, vaccination advice, recommended doctors visits and specific condition guidance.\n", "source": "https://builtin.com/artificial-intelligence/examples-ai-in-industry"}, {"text": "Industry: Diagnostics\n\nLocation: New York, NY\n\nHow it’s using AI: Covera Health is utilizing collaborative data sharing and applied clinical analysis to reduce the number of misdiagnosed patients throughout the world. The company’s proprietary technology utilizes a framework that combines advanced data science and artificial intelligence to sort through existing diagnostics to provide practitioners with more accurate symptom data when making a decision that will have a major impact on a patient’s life — reducing cascading effects of misguided care and saving the healthcare industry hundreds of billions of dollars.\n", "source": "https://builtin.com/artificial-intelligence/examples-ai-in-industry"}, {"text": "AI-powered wearables track health conditions\n\nMost of the time, follow-ups post a health condition are very mandatory. Unfortunately, we, humans, are very careless about keeping track of our health conditions. Some healthcare facilities offer such follow-ups or life coaching services, which are extremely expensive. However, AI-powered wearables can help patients in keeping track of their health issues. For example, when a patient wears an AI-powered watch, the device captures their real-time healthcare data and gives suggestions on required medication, exercise, activities, and even habits that could help them maintain their body.\n", "source": "https://www.analyticsinsight.net/top-50-use-cases-of-artificial-intelligence-in-diverse-sectors/"}, {"text": "Predictive analytics to validate the need for surgery\n\nPredictive analytics is a gift to healthcare. Sometimes, we come across patients who say they underwent an unnecessary surgery due to a lack of predictions on what was coming. Fortunately, artificial intelligence is changing the fate of such burdensome risks and avoidable surgeries. By using artificial intelligence and predictive analytics, healthcare professionals can identify if the patient needs surgery or not. The technology will assist doctors to evaluate whether the operation is actually necessary or if there is an alternative with far less risk involved.\n", "source": "https://www.analyticsinsight.net/top-50-use-cases-of-artificial-intelligence-in-diverse-sectors/"}, {"text": "Industry: Health Diagnostics, Machine Learning\n\nLocation: Boston\n\nHow it's using AI: PathAI creates AI-powered technology for pathologists.\n\nThe company's machine learning algorithms help pathologists analyze tissue samples and make more accurate diagnoses. The aim is to not only improve diagnostic accuracy, but also treatment. PathAI's technology can also identify optimal clinical trial participants.\n\nPathAI has worked with the Bill & Melinda Gates Foundation and Philips to develop high-volume prognostic test support tools and plans for sustainable access to their advanced diagnostic services.\n", "source": "https://builtin.com/artificial-intelligence/examples-ai-in-industry"}, {"text": "Industry: Healthcare, Mobile App\n\nLocation: NYC\n\nHow it's using AI: Pager uses artificial intelligence to help patients with minor aches, pains and illnesses.\n\nThe company deploys machine learning to analyze clinical and claims data to discover gaps in a patient’s healthcare treatment. In addition to making healthcare recommendations, this concierge-like service helps patients schedule appointments and make payments.\n\nThe Pager app allows any user to chat with a nurse via text 24/7, talk to a doctor via video chat and have prescriptions filled as needed.  \n", "source": "https://builtin.com/artificial-intelligence/examples-ai-in-industry"}, {"text": "AI USE CASE #2: Quality inspection & assurance\n\nQuality inspection and quality assurance is the second largest industrial AI use case category at 20.5%. While there are various ways to do AI-based quality inspection, automated optical inspection is by far the largest sub-category.\n\nAutomated optical inspection is a technique where a camera autonomously scans the device under test for catastrophic failure (e.g. missing component) and/or quality defects (e.g. fillet size or shape or component skew). Computer vision is the foundation of optical inspection. Once the images are recognized, semi-supervised ML is the most effective technique to classify images into failure classes. The main benefit of this use case is cost reduction, and the main potential beneficiaries are large manufacturing facilities, where a small reduction in scrap or test time can yield very large savings.\n\nCost implications: after implementing optical inspection on one of its plants, BOSCH claimed to achieve $1.3M savings due to 45% of total test time reduction. Source: BOSCH.\n\n    Example: A major German automotive company is introducing a deep learning-enabled system for quality control. This system is fully integrated into the flow of the final assembly process and thereby gets rid of the need to have a separate testing area in a controlled environment. The solution is expected to soon replace conventional camera booths that are used today and according to the OEM will result in “immense savings”.\n", "source": "https://iot-analytics.com/the-top-10-industrial-ai-use-cases/"}, {"text": "OCR to Recognize and Extract Data from Driver’s Licenses, ID Books, and Smart Cards\n\n\nImproved recognition accuracy up to 90%.\n\n    Challenge\n    Identifying and deriving sensitive data from image scans and facilitating document-based processes\n    Solution\n    OCR-based solution to capture and retrieve data from document scans automatically\n    Technologies and tools\n    Python PyTorch Tesseract Opencv\n\nClient\n\nThe client is a South African content management solution provider that works with the key players in the banking industry of the country. The client’s main objective is to assist companies in capturing and managing data assets in order to improve operational efficiency. To accomplish this, they integrate different automation toolkits.\n\nThis case study will highlight our expertise in computer vision and the importance of OCR when dealing with document scans.\nChallenge: capture and derive data from document scans and facilitate document workflow\n\nThe client deals with large volumes of data on a regular basis. Manual data search and its recognition from ID books, smart cards, driver’s licenses or any other documents are time-consuming and tedious. That’s why the client was looking for automated data capture and extraction solution. They needed an expert opinion on integrating OCR into their ERP system to handle critical business functions. But the primary objective was to leverage data from document scans and reduce its manual processing and entry because it was taking much time.\n\nThe major challenge for our team was to capture and retrieve data from photo scans that often vary in orientations, positions, colours, backgrounds, and lighting conditions. We delivered a service that helps recognize objects in the image scans and determine what data needs to be derived.\nSolution: OCR-based solution to automate data capture and extraction from document scans\n\nHaving broad experience in OCR implementation, the InData Labs team provided the client with a custom-made solution that helps automate data-based business processes in the client’s workplace and improve the overall work performance.\n\nOur team investigated the feasibility of extracting and recognizing text fields such as name, surname, ID, valid from/to from driver’s licenses from DMV databases, business cards, ID books, and smart cards using OCR. When it comes to leveraging data, these types of documents are uneasy to deal with. In this case, facial recognition comes to aid and helps derive data from damaged driver’s licenses or blurred ID books.\n\nThe next step was finding out how to use facial recognition to identify an individuals face in their driver’s license photo or any other document scan. We started developing image pre-processing functionality that significantly improved the efficiency of a commercial built-in OCR engine by automated cropping, rotation and deskewing. We also advanced the existing document classifier to distinguish 3 types of documents: a smart card, ID book, and a driver’s license. We split this process into two phases: image normalization and field recognition.\n\n1. Image normalization\n\nThe main challenge for the OCR engines is to recognize rotated, skewed, darkened and blurred scans as well as photo scans with a complex background that usually leads to misunderstanding and errors. To mitigate that, we trained a model to capture a document, crop it, and deskew an image. This phase significantly improved default pipeline recognition. As a result, we got a document without any background positioned correctly.\n\n2. Field recognition\n\nThe next task was to capture and identify the required fields in the normalized image. To complete this, our data scientists trained another ML model that predicts where exactly the particular field is located. Having the precise location of the required fields they could crop them from the normalized image and identify them independently. That gave our team more freedom in preprocessing and optimizing the performance of the OCR engine.\n\nTo recognize the required fields we applied Tesseract OCR or Captiva built-in OCR engines.\n\nTake a closer look at the OCR use case diagram:\n\nOCR use case diagram\nResult: OCR data capture and extraction solution to reduce manual effort\n\nHaving extensive technical expertise in developing image recognition solutions, our engineers have delivered a robust solution that automatically captures and derives sensitive data from driver’s licenses, ID books, and smart cards and increases the overall operational efficiency in the client’s workplace.\n\nOur solution enables the processing of a document scan in 2 seconds. 4 document scans can be processed simultaneously. The recognition accuracy is about 85-90%.\n\nCooperation with us has empowered the client in the following aspects:\n\n    Automated text and image recognition\n    Easy and smart data extraction from scanned papers\n    Overall speedup when processing scanned text and images\n    OCR integration into the client’s ERP system\n    Reducing the manual effort in the client’s workplace\n", "source": "https://indatalabs.com/resources/ocr-solution-invoice-processing"}, {"text": "From interacting with patients to directing patients to the most effective care setting, virtual nursing assistants could save the healthcare industry $20 billion annually. Since virtual nurses are available 24/7, they can answer questions, monitor patients and provide quick answers. Most applications of virtual nursing assistants today allow for more regular communication between patients and care providers between office visits to prevent hospital readmission or unnecessary hospital visits. Care Angel’s virtual nurse assistant can even provide wellness checks through voice and AI.\n", "source": "https://bernardmarr.com/how-is-ai-used-in-healthcare-5-powerful-real-world-examples-that-show-the-latest-advances/"}], "sector_presentation": "Artificial intelligence (AI) is reshaping healthcare, and its use is becoming a reality in many medical fields and specialties. AI, machine learning (ML), natural language processing (NLP) and deep learning (DL) enable healthcare stakeholders and medical professionals to identify healthcare needs and solutions faster with more accuracy, using data patterns to make informed medical or business decisions quickly."}